var address = [
    {
        pro : '北京市',
        city : ["北京"],
    },
    {
        pro : '天津市',
        city : ["天津"],
    },
    {
        pro : '重庆市',
        city : ["重庆"],
    },
    {
        pro : '上海市',
        city : ["上海"],
    },
    {
        pro : '河北省',
        city : ["石家庄", "保定", "沧州", "承德", "邯郸", "衡水", "廊坊", "秦皇岛", "唐山", "邢台", "张家口", "雄安新区"],
    },
    {
        pro : '山西省',
        city : ["太原", "长治", "大同", "晋城", "晋中", "临汾", "吕梁", "朔州", "忻州", "阳泉", "运城"],
    },
    {
        pro : '辽宁省',
        city : ["沈阳", "大连", "鞍山", "本溪", "朝阳", "丹东", "抚顺", "阜新", "葫芦岛", "锦州", "辽阳", "盘锦", "铁岭", "营口"],
    },
    {
        pro : '吉林省',
        city : ["长春", "吉林", "白城", "白山", "辽源", "四平", "松原", "通化", "延边"],
    },
    {
        pro : '黑龙江省',
        city : ["哈尔滨", "大庆", "大兴安岭", "鹤岗", "黑河", "鸡西", "佳木斯", "牡丹江", "七台河", "齐齐哈尔", "双鸭山", "绥化", "伊春"],
    },
    {
        pro : '江苏省',
        city : ["南京", "苏州", "无锡", "常州", "淮安", "连云港", "南通", "宿迁", "泰州", "徐州", "盐城", "扬州", "镇江"],
    },
    {
        pro : '浙江省',
        city : ["杭州", "湖州", "嘉兴", "金华", "丽水", "宁波", "绍兴", "台州", "温州", "舟山", "衢州"],
    },
    {
        pro : '安徽省',
        city : ["合肥", "安庆", "蚌埠", "池州", "滁州", "阜阳", "淮北", "淮南", "黄山", "六安", "马鞍山", "宿州", "铜陵", "芜湖", "宣城", "亳州"],
    },
    {
        pro : '福建省',
        city : ["福州", "龙岩", "南平", "宁德", "莆田", "泉州", "三明", "厦门", "漳州"],
    },
    {
        pro : '江西省',
        city : ["南昌", "抚州", "赣州", "吉安", "景德镇", "九江", "萍乡", "上饶", "新余", "宜春", "鹰潭"],
    },
    {
        pro : '山东省',
        city : ["济南", "青岛", "滨州", "德州", "东营", "菏泽", "济宁", "莱芜", "聊城", "临沂", "日照", "泰安", "威海", "潍坊", "烟台", "枣庄", "淄博"],
    },
    {
        pro : '河南省',
        city : ["郑州", "洛阳", "开封", "安阳", "鹤壁", "济源", "焦作", "南阳", "平顶山", "三门峡", "商丘", "新乡", "信阳", "许昌", "周口", "驻马店", "漯河", "濮阳"],
    },
    {
        pro : '湖北省',
        city : ["武汉", "仙桃", "鄂州", "黄冈", "黄石", "荆门", "荆州", "潜江", "神农架", "十堰", "随州", "天门", "咸宁", "襄樊", "孝感", "宜昌", "恩施"],
    },
    {
        pro : '湖南省',
        city : ["长沙", "张家界", "常德", "郴州", "衡阳", "怀化", "娄底", "邵阳", "湘潭", "湘西", "益阳", "永州", "岳阳", "株洲"],
    },
    {
        pro : '广东省',
        city : ["广州", "深圳", "潮州", "东莞", "佛山", "河源", "惠州", "江门", "揭阳", "茂名", "梅州", "清远", "汕头", "汕尾", "韶关", "阳江", "云浮", "湛江", "肇庆", "中山", "珠海"],
    },
    {
        pro : '海南省',
        city : ["海口", "三亚", "白沙", "保亭", "昌江", "澄迈县", "定安县", "东方", "乐东县", "临高县", "陵水", "琼海", "琼中", "屯昌县", "万宁", "文昌", "五指山", "儋州", "三沙"],
    },
    {
        pro : '四川省',
        city : ["成都", "绵阳", "阿坝", "巴中", "达州", "德阳", "甘孜", "广安", "广元", "乐山", "凉山", "眉山", "南充", "内江", "攀枝花", "遂宁", "雅安", "宜宾", "资阳", "自贡", "泸州"],
    },
    {
        pro : '贵州省',
        city : ["贵阳", "安顺", "毕节", "六盘水", "黔东南", "黔南", "黔西南", "铜仁", "遵义"],
    },
    {
        pro : '云南省',
        city : ["昆明", "怒江", "普洱", "丽江", "保山", "楚雄", "大理", "德宏", "迪庆", "红河", "临沧", "曲靖", "文山", "西双版纳", "玉溪", "昭通"],
    },
    {
        pro : '陕西省',
        city : ["西安", "安康", "宝鸡", "汉中", "商洛", "铜川", "渭南", "咸阳", "延安", "榆林"],
    },
    {
        pro : '甘肃省',
        city : ["兰州", "白银", "定西", "甘南州", "嘉峪关", "金昌", "酒泉", "临夏", "陇南", "平凉", "庆阳", "天水", "武威", "张掖"],
    },
    {
        pro : '青海省',
        city : ['西宁', '果洛', '海北', '海东', '海南州', '海西', '黄南', '玉树'],
    },
    {
        pro : '广西壮族自治区',
        city : ["崇左", "防城港", "贵港", "河池", "贺州", "来宾", "柳州", "钦州", "梧州", "玉林", "南宁", "桂林", "百色", "北海"],
    },
    {
        pro : '内蒙古自治区',
        city : ["呼和浩特", "阿拉善盟", "巴彦淖尔", "包头", "赤峰", "鄂尔多斯", "呼伦贝尔", "通辽", "乌海", "乌兰察布", "锡林郭勒", "兴安盟"],
    },
    {
        pro : '西藏自治区',
        city : ['拉萨', '阿里', '昌都', '林芝', '那曲', '日喀则', '山南'],
    },
    {
        pro : '宁夏回族自治区',
        city : ['银川', '固原', '石嘴山' ,'吴忠', '中卫'],
    },
    {
        pro : '新疆维吾尔自治区',
        city : ['乌鲁木齐', '阿克苏', '阿拉尔', '巴音郭楞', '博尔塔拉', '昌吉', '哈密', '和田', '喀什', '克拉玛依', '克孜勒苏', '石河子', '图木舒克', '吐鲁番', '五家渠', '伊犁', '北屯', '塔城地区', '阿勒泰地区', '铁门关', '双河', '可克达拉', '昆玉'],
    },
    {
        pro : '台湾省',
        city : ['台北市', '高雄市', '基隆市', '新竹市', '台中市', '嘉义市', '台北县', '宜兰县', '桃园县', '新竹县', '苗栗县', '台中县', '彰化县',     '南投县', '云林县', '嘉义县', '台南县', '高雄县', '屏东县', '台东县', '花莲县', '澎湖县'],
    },
    {
        pro : '香港特别行政区',
        city : ['香港' ],
    },
    {
        pro : '澳门特别行政区',
        city : ['澳门' ],
    },
    ];
 //数据暴露出去
 module.exports = {  
    data: address
}
